# Разработка системы предупреждения аварий на каршеринге
## Описание проекта
Я — специалист по Data Science в каршеринговой компании. Мне поступил заказ: нужно создать систему, которая могла бы оценить риск ДТП по выбранному маршруту движения. Под риском понимается вероятность ДТП с любым повреждением транспортного средства. Как только водитель забронировал автомобиль, сел за руль и выбрал маршрут, система должна оценить уровень риска. Если уровень риска высок, водитель увидит предупреждение и рекомендации по маршруту.
Идея создания такой системы находится в стадии предварительного обсуждения и проработки. Чёткого алгоритма работы и подобных решений на рынке ещё не существует. Текущая задача — понять, возможно ли предсказывать ДТП, опираясь на исторические данные одного из регионов.
## Навыки и инструменты
**Теги: классификация, PostgreSQL, SQLAlchemy, CatBoost, LinearRegression, RandomForest, Pandas**

<img src="https://img.shields.io/badge/Pandas-black?style=flat-square&logo=pandas&logoColor=orange"/><img src="https://img.shields.io/badge/Plotly-black?style=flat-square&logo=plotly&logoColor=orange"/>
## Сферы деятельности:
Интернет-сервисы, оффлайн, бизнес
## Основные пункты исследования:
 - Подключение к базе SQL и загрузка таблиц.
 - Статистический анализ факторов ДТП.
 - Определение аналитических задач.
 - Решение аналитических задач.
 - Подготовка данных.
 - Обучение и проверка моделей, обоснование выбора метрики.
 - Тестирование лучшей модели.
 - Анализ важности факторов ДТП.

## Выводы и результаты
Создание адекватной системы оценки риска возможно, если добыть достаточное кол-во информации. В нашем случае необходимо:
- Во-первых, оборудовать авто алкотестером. 
- Во-вторых, было бы неплохо более точно определить места, в которых ДТП происходят очень часто. Ведь у нас есть информация только по районам, и модель будет указывать объехать весь район (которые зачастую немаленькие), чтобы, возможно, обойти какой-то опасный поворот/перекресток. Это еще и даст прирост на показателе качества модели.

Я смог построить вполне неплохую модель, но считаю, что нужно дополнить её данными, чтобы можно было использовать на практике.
